/*
    4. Оголосіть клас вузла Node, який підтримує цілі числа.
*/

//-------------------------------інтерфейс----------------------------------
//  Клас Node в коді є шаблонним (базовим) класом, 
// який служить інтерфейсом з загальною поведінкою, 
// яку можуть наслідувати інші класи. 
// Це означає, що Node встановлює “правила гри” для класів
class Node //Встановлює правила гри
{
public:
	virtual ~Node() {}//Віртуальний деструктор
	virtual Node* Insert(Data* theData) = 0;// Чиста віртуальна функція для вставки даних
	virtual void Show() = 0;// Чиста віртуальна функція для відображення даних
};
//---------------------------------------------------------------------
